; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v4 ?v3)
             (pred_11 ?v5 ?v9)
             (pred_8 ?v4 ?v9)
             (pred_4 ?v11 ?v4 )
	     (pred_2 ?v4)
             (pred_7 ?v8)
             (pred_1 ?v5)
             (pred_3 ?v9)
             (pred_6 ?v4)
             (pred_5 ?v5)
             (pred_12 ?v4)
             (pred_9 ))



(:action op_1
:parameters (?v2 ?v10 ?v6 ?v1)
:precondition (and (pred_7 ?v2) (pred_7 ?v10) (pred_1 ?v6) (pred_3 ?v1)
          (pred_10 ?v2 ?v10) (pred_11 ?v6 ?v1)
                   (pred_8 ?v10 ?v1) (pred_2 ?v2) 
                   (pred_6 ?v10) (pred_5 ?v6))
:effect (and  (pred_12 ?v10) (not (pred_6 ?v10))))


(:action op_2
:parameters (?v2 ?v12)
:precondition (and (pred_7 ?v2) (pred_7 ?v12)
               (pred_2 ?v2) (pred_10 ?v2 ?v12) (pred_12 ?v12))
:effect (and (pred_2 ?v12) (not (pred_2 ?v2))))

(:action op_5
:parameters (?v2 ?v6)
:precondition (and (pred_7 ?v2) (pred_1 ?v6) 
                  (pred_2 ?v2) (pred_4 ?v6 ?v2) (pred_9 ))
:effect (and (pred_5 ?v6)
   (not (pred_4 ?v6 ?v2)) (not (pred_9 ))))


(:action op_3
:parameters (?v2 ?v13 ?v7)
:precondition (and (pred_7 ?v2) (pred_1 ?v13) (pred_1 ?v7)
                  (pred_2 ?v2) (pred_5 ?v7) (pred_4 ?v13 ?v2))
:effect (and (pred_5 ?v13) (pred_4 ?v7 ?v2)
        (not (pred_5 ?v7)) (not (pred_4 ?v13 ?v2))))

(:action op_4
:parameters (?v2 ?v6)
:precondition (and (pred_7 ?v2) (pred_1 ?v6) 
                  (pred_2 ?v2) (pred_5 ?v6))
:effect (and (pred_9 ) (pred_4 ?v6 ?v2) (not (pred_5 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_05 obj_10 obj_07 obj_18 obj_16 obj_21 obj_04 obj_17 obj_12 obj_08 obj_11 obj_19 obj_02 obj_13 obj_14
    obj_06 obj_20
    obj_01 obj_09 obj_03
    )

    (:init
       (pred_9)

       (pred_7 obj_15)
       (pred_7 obj_05)
       (pred_7 obj_10)
       (pred_7 obj_07)
       (pred_7 obj_18)
       (pred_7 obj_16)
       (pred_7 obj_21)
       (pred_7 obj_04)
       (pred_7 obj_17)
       (pred_7 obj_12)
       (pred_7 obj_08)
       (pred_7 obj_11)
       (pred_7 obj_19)
       (pred_7 obj_02)
       (pred_7 obj_13)
       (pred_7 obj_14)
       (pred_3 obj_06)
       (pred_3 obj_20)
       (pred_1 obj_01)
       (pred_1 obj_09)
       (pred_1 obj_03)

       (pred_10 obj_15 obj_18)
       (pred_10 obj_15 obj_05)
       (pred_10 obj_05 obj_16)
       (pred_10 obj_05 obj_10)
       (pred_10 obj_05 obj_15)
       (pred_10 obj_10 obj_21)
       (pred_10 obj_10 obj_07)
       (pred_10 obj_10 obj_05)
       (pred_10 obj_07 obj_04)
       (pred_10 obj_07 obj_10)
       (pred_10 obj_18 obj_17)
       (pred_10 obj_18 obj_16)
       (pred_10 obj_18 obj_15)
       (pred_10 obj_16 obj_12)
       (pred_10 obj_16 obj_21)
       (pred_10 obj_16 obj_05)
       (pred_10 obj_16 obj_18)
       (pred_10 obj_21 obj_08)
       (pred_10 obj_21 obj_04)
       (pred_10 obj_21 obj_10)
       (pred_10 obj_21 obj_16)
       (pred_10 obj_04 obj_11)
       (pred_10 obj_04 obj_07)
       (pred_10 obj_04 obj_21)
       (pred_10 obj_17 obj_19)
       (pred_10 obj_17 obj_12)
       (pred_10 obj_17 obj_18)
       (pred_10 obj_12 obj_02)
       (pred_10 obj_12 obj_08)
       (pred_10 obj_12 obj_16)
       (pred_10 obj_12 obj_17)
       (pred_10 obj_08 obj_13)
       (pred_10 obj_08 obj_11)
       (pred_10 obj_08 obj_21)
       (pred_10 obj_08 obj_12)
       (pred_10 obj_11 obj_14)
       (pred_10 obj_11 obj_04)
       (pred_10 obj_11 obj_08)
       (pred_10 obj_19 obj_02)
       (pred_10 obj_19 obj_17)
       (pred_10 obj_02 obj_13)
       (pred_10 obj_02 obj_12)
       (pred_10 obj_02 obj_19)
       (pred_10 obj_13 obj_14)
       (pred_10 obj_13 obj_08)
       (pred_10 obj_13 obj_02)
       (pred_10 obj_14 obj_11)
       (pred_10 obj_14 obj_13)
       (pred_6 obj_10)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_8  obj_10 obj_06)
       (pred_8  obj_13 obj_20)
       (pred_8  obj_18 obj_20)
       (pred_12 obj_15)
       (pred_12 obj_05)
       (pred_12 obj_07)
       (pred_12 obj_16)
       (pred_12 obj_21)
       (pred_12 obj_04)
       (pred_12 obj_17)
       (pred_12 obj_12)
       (pred_12 obj_08)
       (pred_12 obj_11)
       (pred_12 obj_19)
       (pred_12 obj_02)
       (pred_12 obj_14)

       (pred_11  obj_01 obj_06)
       (pred_11  obj_09 obj_20)
       (pred_11  obj_03 obj_20)
       (pred_4 obj_01 obj_19)
       (pred_4 obj_09 obj_15)
       (pred_4 obj_03 obj_21)
       (pred_2 obj_04)
    )

    (:goal (and
       (pred_4 obj_03 obj_18)
    ))
(:constraints
  (always (not (pred_2 obj_16)))
)
)

; plan
1. (op_2 obj_04 obj_21)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_21)
   goals met: 0 of 1
2. (op_5 obj_21 obj_03)
   deleted: (pred_4 obj_03 obj_21) (pred_9)
   added: (pred_5 obj_03)
   goals met: 0 of 1
3. (op_2 obj_21 obj_08)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_08)
   goals met: 0 of 1
4. (op_2 obj_08 obj_12)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_12)
   goals met: 0 of 1
5. (op_2 obj_12 obj_17)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_17)
   goals met: 0 of 1
6. (op_1 obj_17 obj_18 obj_03 obj_20)
   deleted: (pred_6 obj_18)
   added: (pred_12 obj_18)
   goals met: 0 of 1
7. (op_2 obj_17 obj_18)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_18)
   goals met: 0 of 1
8. (op_4 obj_18 obj_03)
   deleted: (pred_5 obj_03)
   added: (pred_9) (pred_4 obj_03 obj_18)
   goals met: 1 of 1
